app/views/prompts/show.html.erb

SELECT "crowd_stories".* FROM "crowd_stories" WHERE "crowd_stories"."prompt_id" = $1  [["prompt_id", 1]]
---

    <% @prompt.crowd_stories.each do |crowd_story| %>

INSERT INTO "crowd_stories" ("created_at", "updated_at", "prompt_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-08-24 01:06:52.634366"], ["updated_at", "2019-08-24 01:06:52.634366"], ["prompt_id", 2]]
---
      <h3>Add to the Story!</h3>
      <%= simple_form_for [@prompt, @prompt.crowd_stories.create] do |f| %>