app/controllers/crowd_stories_controller.rb

  def index
    @crowd_stories = CrowdStory.all
---
SELECT "crowd_stories".* FROM "crowd_stories"

  def create
    @prompt = Prompt.find(params[:id])
    @crowd_story = @prompt.crowd_stories.create(crowd_story_params)
---
SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "crowd_stories" ("story", "created_at", "updated_at", "prompt_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["story", "Eureka"], ["created_at", "2019-08-22 03:09:39.849295"], ["updated_at", "2019-08-22 03:09:39.849295"], ["prompt_id", 3]]

  def update
    if @crowd_story.update(crowd_story_params)
---
UPDATE "crowd_stories" SET "story" = $1, "updated_at" = $2 WHERE "crowd_stories"."id" = $3  [["story", "We were on the edge of the desert when the drugs began to take hold..."], ["updated_at", "2019-08-22 03:11:34.703429"], ["id", 9]]

  def destroy
    @crowd_story.destroy
---
DELETE FROM "crowd_stories" WHERE "crowd_stories"."id" = $1  [["id", 6]]

    def set_crowd_story
      @crowd_story = CrowdStory.find(params[:id])
---
SELECT "crowd_stories".* FROM "crowd_stories" WHERE "crowd_stories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]