app/controllers/crowd_stories_controller.rb

SELECT "crowd_stories".* FROM "crowd_stories" WHERE "crowd_stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @crowd_story = CrowdStory.find(params[:id])

SELECT "crowd_stories".* FROM "crowd_stories" WHERE "crowd_stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @crowd_story = CrowdStory.find(params[:id])