app/controllers/images_controller.rb

  def show
    @image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("title", "imagedata", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Airship"], ["imagedata", "airship.jpg"], ["created_at", "2019-09-02 15:29:21.638434"], ["updated_at", "2019-09-02 15:29:21.638434"]]