app/controllers/prompts_controller.rb

  def index
    @prompts = Prompt.all
---
SELECT "prompts".* FROM "prompts"

    def set_prompt
      @prompt = Prompt.find(params[:id])
---
SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]