app/controllers/sendimages_controller.rb

def index
  @images = ImagePost.all
---
SELECT "image_posts".* FROM "image_posts"

def show
  @image = ImagePost.find(params[:id])
---
SELECT "image_posts".* FROM "image_posts" WHERE "image_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]